Documents/СписаниеОпций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>СписаниеОпций</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УчетОпций</xr:Item>
				<xr:Item>AccumulationRegister.УчетЗанятий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тренер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Тренеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Опции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуги</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СписаниеОпций/Ext/ObjectModule.bsl
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
 	Префикс = Обмен.ПолучитьПрефиксНомера();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Если Режим = РежимПроведенияДокумента.Оперативный Тогда 	
        Запрос4 = Новый Запрос;     
		МенеджерВТ = Новый МенеджерВременныхТаблиц;
		Запрос4.МенеджерВременныхТаблиц = МенеджерВТ;
        Запрос4.Текст = 
        "ВЫБРАТЬ
            |УчетЗанятийОбороты.Тренер КАК Тренер,
            |УчетЗанятийОбороты.ВремяНачала КАК ВремяНачала,
            |УчетЗанятийОбороты.ВремяОкончания КАК ВремяОкончания
        	|	ИЗ
            |РегистрНакопления.УчетЗанятий.Обороты КАК УчетЗанятийОбороты
        	|	ГДЕ
            |УчетЗанятийОбороты.Тренер = &Тренер
            |И (
            |    (УчетЗанятийОбороты.ВремяНачала < &ВремяОкончания И УчетЗанятийОбороты.ВремяОкончания > &ВремяНачала)
            |    ИЛИ
            |    (УчетЗанятийОбороты.ВремяНачала = &ВремяНачала И УчетЗанятийОбороты.ВремяОкончания = &ВремяОкончания))";  

        Запрос4.УстановитьПараметр("Тренер", Тренер);
        Запрос4.УстановитьПараметр("ВремяНачала", ВремяНачала); 
        Запрос4.УстановитьПараметр("ВремяОкончания", ВремяОкончания);  
        
        РезультатЗапроса = Запрос4.Выполнить();
        ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
        
        Если ВыборкаДетальныеЗаписи.Следующий() Тогда    
            Сообщение = Новый СообщениеПользователю();
            Сообщение.Текст = "Вы не можете записаться на " + Строка(ВыборкаДетальныеЗаписи.ВремяНачала) + " к тренеру " + Строка(ВыборкаДетальныеЗаписи.Тренер) + ", так как это время занято";
            Сообщение.Сообщить();    
            Отказ = Истина;
        КонецЕсли; 
    КонецЕсли;
	// регистр УчетЗанятий 
	Движения.УчетЗанятий.Записывать = Истина;
	Для Каждого ТекСтрокаОпции Из Опции Цикл
		Движение = Движения.УчетЗанятий.Добавить();
		Движение.Период = Дата;
		Движение.ВремяНачала = ВремяНачала;
		Движение.ВремяОкончания = ВремяОкончания;
		Движение.Клиент = Клиент;
		Движение.Тренер = Тренер;
		Движение.Услуги = ТекСтрокаОпции.Услуги;
		Движение.Количество = ТекСтрокаОпции.Количество;
	КонецЦикла;

	// регистр УчетОпций Расход
	Движения.УчетОпций.Записывать = Истина;
	Для Каждого ТекСтрокаОпции Из Опции Цикл
		Движение = Движения.УчетОпций.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Услуги = ТекСтрокаОпции.Услуги;
		Движение.Количество = ТекСтрокаОпции.Количество;
	КонецЦикла;
	
	Движения.Записать();
	
	Если Режим = РежимПроведенияДокумента.Оперативный Тогда
		Запрос3 = Новый Запрос;  
		МенеджерВТ = Новый МенеджерВременныхТаблиц;
		Запрос3.МенеджерВременныхТаблиц = МенеджерВТ;
		Запрос3.Текст = "ВЫБРАТЬ
		                |	УчетОпцийОстатки.Клиент КАК Клиент,
		                |	УчетОпцийОстатки.Услуги КАК Услуги,
		                |	УчетОпцийОстатки.КоличествоОстаток КАК КоличествоОстаток
		                |ИЗ
		                |	РегистрНакопления.УчетОпций.Остатки КАК УчетОпцийОстатки
		                |ГДЕ
		                |	УчетОпцийОстатки.КоличествоОстаток < 0"; 
	РезультатЗапроса = Запрос3.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = "Вы не можете использовать заданное количество опций, так как по Вашему абонементу не хватает " + Строка(- ВыборкаДетальныеЗаписи
	.КоличествоОстаток) + " применений услуги """
	+ ВыборкаДетальныеЗаписи.Услуги + """";
	Сообщение.Сообщить();
	Отказ = Истина;
КонецЦикла; 
    КонецЕсли;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
